ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_UsbDevice.cpp
typedef struct {
    UsClientState* usClientState;

    uint8_t     previousDeviceState;
    uint16_t    endpointType;

} UsbDeviceController;

static const STM32F7_Gpio_Pin usbClientDmPins[] = STM32F7_USB_DM_PINS;
static const STM32F7_Gpio_Pin usbClientDpPins[] = STM32F7_USB_DP_PINS;
static const STM32F7_Gpio_Pin usbClientVbPins[] = STM32F7_USB_VB_PINS;
static const STM32F7_Gpio_Pin usbClientIdPins[] = STM32F7_USB_ID_PINS;

void STM32F7_UsbDevice_ProtectPins(int32_t controller, bool On);
void STM32F7_UsbDevice_Interrupt(void* param);

/* usClientState variables for the controllers */
static UsbDeviceController usbDeviceControllers[STM32F7_TOTAL_USB_CONTROLLERS];

const TinyCLR_Api_Info* STM32F7_UsbDevice_GetApi() {
    return TinyCLR_UsbClient_GetApi();
}
void STM32F7_UsbDevice_Reset() {
    return TinyCLR_UsbClient_Reset(STM32F7_USB_FS_ID);
}

void STM32F7_UsbDevice_InitializeConfiguration(UsClientState *usClientState) {
    int32_t controller = STM32F7_USB_FS_ID;

    if (usClientState != nullptr) {
        usClientState->controllerIndex = controller;

        usClientState->maxFifoPacketCount = STM32F7_USB_PACKET_FIFO_COUNT;
        usClientState->totalEndpointsCount = STM32F7_USB_ENDPOINT_COUNT;
        usClientState->totalPipesCount = STM32F7_USB_PIPE_COUNT;

        usbDeviceControllers[controller].usClientState = usClientState;

        usbDeviceControllers[controller].endpointType = 0;
        for (auto i = 0; i < usbDeviceControllers[controller].usClientState->deviceDescriptor.Configurations->Interfaces->EndpointCount; i++) {
            TinyCLR_UsbClient_EndpointDescriptor  *ep = (TinyCLR_UsbClient_EndpointDescriptor*)&usbDeviceControllers[controller].usClientState->deviceDescriptor.Configurations->Interfaces->Endpoints[i];

            auto idx = ep->Address & 0x0F;

            usbDeviceControllers[controller].endpointType |= (ep->Attributes & 3) << (idx * 2);
        }
    }
}

bool STM32F7_UsbDevice_Initialize(UsClientState* usClientState) {

    if (usClientState == nullptr)
        return false;

    int32_t controller = usClientState->controllerIndex;

    auto& dp = usbClientDpPins[controller];
    auto& dm = usbClientDmPins[controller];
    auto& id = usbClientIdPins[controller];

    if (!STM32F7_GpioInternal_OpenPin(dp.number) || !STM32F7_GpioInternal_OpenPin(dm.number))
        return false;

    if (STM32F7_USB_USE_ID_PIN(controller) && !STM32F7_GpioInternal_OpenPin(id.number))
        return false;

    // Enable USB clock
    // FS on AHB2
    RCC->AHB2ENR |= RCC_AHB2ENR_OTGFSEN;

    OTG_TypeDef* OTG = OTG_FS;

    DISABLE_INTERRUPTS_SCOPED(irq);

    // Detach usb port for a while to enforce re-initialization
    OTG->DCTL = OTG_DCTL_SDIS; // soft disconnect

    OTG->GAHBCFG = OTG_GAHBCFG_TXFELVL;     // int32_t on TxFifo completely empty, int32_t off
    OTG->GUSBCFG = OTG_GUSBCFG_FDMOD        // force device mode
        | STM32F7_USB_TRDT << 10   // turnaround time
        | OTG_GUSBCFG_PHYSEL;      // internal PHY

    OTG->GCCFG = OTG_GCCFG_VBUSBSEN       // B device Vbus sensing
        | OTG_GCCFG_PWRDWN;        // transceiver enabled

    OTG->DCFG |= OTG_DCFG_DSPD;           // device speed = HS

    if (STM32F7_USB_USE_VB_PIN(controller) == 0) { // no Vbus pin
        OTG->GCCFG |= OTG_GCCFG_NOVBUSSENS; // disable vbus sense
    }

    STM32F7_Time_Delay(nullptr, 1000); // asure host recognizes reattach

    // setup hardware
    STM32F7_UsbDevice_ProtectPins(controller, true);

    STM32F7_InterruptInternal_Activate(OTG_FS_IRQn, (uint32_t*)&STM32F7_UsbDevice_Interrupt, 0);
    STM32F7_InterruptInternal_Activate(OTG_FS_WKUP_IRQn, (uint32_t*)&STM32F7_UsbDevice_Interrupt, 0);

    // allow interrupts
    OTG->GINTSTS = 0xFFFFFFFF;           // clear all interrupts
    OTG->GINTMSK = OTG_GINTMSK_USBRST;   // enable reset only
    OTG->DIEPEMPMSK = 0;                 // disable Tx FIFO empty interrupts
    OTG->GAHBCFG |= OTG_GAHBCFG_GINTMSK; // gloabl interrupt enable

    OTG->GOTGCTL |= USB_OTG_GOTGCTL_BVALOEN | USB_OTG_GOTGCTL_BVALOVAL;

    return true;
}

bool STM32F7_UsbDevice_Uninitialize(UsClientState* usClientState) {
    STM32F7_InterruptInternal_Deactivate(OTG_FS_WKUP_IRQn);
    STM32F7_InterruptInternal_Deactivate(OTG_FS_IRQn);

    RCC->AHB2ENR &= ~RCC_AHB2ENR_OTGFSEN;

    if (usClientState != nullptr) {
        STM32F7_UsbDevice_ProtectPins(usClientState->controllerIndex, false);
        usClientState->currentState = USB_DEVICE_STATE_UNINITIALIZED;
    }

    return true;
}

void STM32F7_UsbDevice_ResetEvent(OTG_TypeDef* OTG, UsClientState* usClientState) {
    // reset interrupts and FIFOs
    OTG->GINTSTS = 0xFFFFFFFF; // clear global interrupts
    OTG->GRXFSIZ = USB_RXFIFO_SIZE; // Rx Fifo
    OTG->DIEPTXF0 = (USB_TX0FIFO_SIZE << 16) | USB_RXFIFO_SIZE; // Tx Fifo 0
    uint32_t addr = USB_RXFIFO_SIZE + USB_TX0FIFO_SIZE;
    for (int32_t i = 0; i < usClientState->totalEndpointsCount; i++) {
        OTG->DIEPTXF[i] = (USB_TXnFIFO_SIZE << 16) | addr; // Tx Fifo i
        addr += USB_TXnFIFO_SIZE;
        OTG->DIEP[i].INT = 0xFF; // clear endpoint interrupts
        OTG->DOEP[i].INT = 0xFF;
        OTG->DIEP[i].CTL = OTG_DIEPCTL_EPDIS; // deactivate endpoint
        OTG->DOEP[i].CTL = OTG_DOEPCTL_EPDIS;
    }

    // flush FIFOs
    OTG->GRSTCTL = OTG_GRSTCTL_RXFFLSH | OTG_GRSTCTL_TXFFLSH | OTG_GRSTCTL_TXF_ALL;

    // configure control endpoint
    OTG->DIEP[0].CTL = OTG_DIEPCTL_USBAEP; // Tx FIFO num = 0, max packet size = 64
    OTG->DOEP[0].CTL = OTG_DOEPCTL_USBAEP;
    OTG->DIEP[0].TSIZ = 0;
    OTG->DOEP[0].TSIZ = OTG_DOEPTSIZ_STUPCNT; // up to 3 setup packets

    // configure data endpoints
    uint32_t intMask = 0x00010001; // ep0 interrupts;
    uint32_t eptype = usbDeviceControllers[usClientState->controllerIndex].endpointType >> 2; // endpoint types (2 bits / endpoint)
    uint32_t i = 1, bit = 2;
    while (eptype) {
        uint32_t type = eptype & 3;
        if (type != 0) { // data endpoint
            uint32_t ctrl = OTG_DIEPCTL_SD0PID | OTG_DIEPCTL_USBAEP;
            ctrl |= type << 18; // endpoint type
            ctrl |= usClientState->maxEndpointsPacketSize[i]; // packet size
            if (usClientState->isTxQueue[i]) { // Tx (in) endpoint
                ctrl |= OTG_DIEPCTL_SNAK; // disable tx endpoint
                ctrl |= i << 22; // Tx FIFO number
                OTG->DIEP[i].CTL = ctrl; // configure in endpoint
                intMask |= bit; // enable in interrupt
            }
            else { // Rx (out) endpoint
                // Rx endpoints must be enabled here
                // Enabling after Set_Configuration does not work correctly
                OTG->DOEP[i].TSIZ = OTG_DOEPTSIZ_PKTCNT_1 | usClientState->maxEndpointsPacketSize[i];
                ctrl |= OTG_DOEPCTL_EPENA | OTG_DOEPCTL_CNAK; // enable rx endpoint
                OTG->DOEP[i].CTL = ctrl; // configure out endpoint
                intMask |= bit << 16; // enable out interrupt
            }
        }
        i++;
        eptype >>= 2;
        bit <<= 1;
    }

    // enable interrupts
    OTG->DIEPMSK = OTG_DIEPMSK_XFRCM; // transfer complete
    OTG->DOEPMSK = OTG_DOEPMSK_XFRCM | OTG_DOEPMSK_STUPM; // setup stage done
    OTG->DAINTMSK = intMask;   // enable ep interrupts
    OTG->GINTMSK = OTG_GINTMSK_OEPINT | OTG_GINTMSK_IEPINT | OTG_GINTMSK_RXFLVLM
        | OTG_GINTMSK_USBRST | OTG_GINTMSK_USBSUSPM | OTG_GINTMSK_WUIM;

    OTG->DCFG &= ~OTG_DCFG_DAD; // reset device address

    /* clear all flags */
    TinyCLR_UsbClient_ClearEvent(usClientState, 0xFFFFFFFF); // clear all events on all endpoints

    usClientState->firstGetDescriptor = true;

    usClientState->deviceState = USB_DEVICE_STATE_DEFAULT;
    usClientState->address = 0;
    TinyCLR_UsbClient_StateCallback(usClientState);
}

void STM32F7_UsbDevice_EndpointRxInterrupt(OTG_TypeDef* OTG, UsClientState* usClientState, uint32_t ep, uint32_t count) {
    uint32_t* pd;

