ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_UsbDevice.cpp
    bool disableRx = false;

    if (ep == 0) { // control endpoint
        pd = (uint32_t*)usClientState->controlEndpointBuffer;
        usClientState->ptrData = (uint8_t*)pd;
        usClientState->dataSize = count;
    }
    else { // data endpoint
        USB_PACKET64* Packet64 = TinyCLR_UsbClient_RxEnqueue(usClientState, ep, disableRx);

        if (disableRx) return;

        pd = (uint32_t*)Packet64->Buffer;
        Packet64->Size = count;
    }

    // read data
    uint32_t volatile* ps = OTG->DFIFO[ep];
    for (int32_t c = count; c > 0; c -= 4) {
        *pd++ = *ps;
    }
}

void STM32F7_UsbDevice_EndpointInInterrupt(OTG_TypeDef* OTG, UsClientState* usClientState, uint32_t ep) {
    uint32_t bits = OTG->DIEP[ep].INT;
    if (bits & OTG_DIEPINT_XFRC) { // transfer completed
        OTG->DIEP[ep].INT = OTG_DIEPINT_XFRC; // clear interrupt
    }

    if (!(OTG->DIEP[ep].CTL & OTG_DIEPCTL_EPENA)) { // Tx idle
        uint32_t* ps = 0;
        uint32_t count;

        if (ep == 0) { // control endpoint
            if (usClientState->dataCallback) { // data to send
                usClientState->dataCallback(usClientState);  // this call can't fail
                ps = (uint32_t*)usClientState->ptrData;
                count = usClientState->dataSize;
            }
        }
        else if (usClientState->queues[ep] != 0 && usClientState->isTxQueue[ep]) { // Tx data endpoint

            USB_PACKET64* Packet64 = TinyCLR_UsbClient_TxDequeue(usClientState, ep);

            if (Packet64) {  // data to send
                ps = (uint32_t*)Packet64->Buffer;
                count = Packet64->Size;
            }
        }

        if (ps) { // data to send
            // enable endpoint
            OTG->DIEP[ep].TSIZ = OTG_DIEPTSIZ_PKTCNT_1 | count;
            OTG->DIEP[ep].CTL |= OTG_DIEPCTL_EPENA | OTG_DIEPCTL_CNAK;

            // write data
            uint32_t volatile* pd = OTG->DFIFO[ep];
            for (int32_t c = count; c > 0; c -= 4) {
                *pd = *ps++;
            }
        }
        else { // no data
            // disable endpoint
            OTG->DIEP[ep].CTL |= OTG_DIEPCTL_SNAK;
        }
    }
}

void STM32F7_UsbDevice_HandleSetup(OTG_TypeDef* OTG, UsClientState* usClientState) {
    /* send last setup packet to the upper layer */
    uint8_t result = TinyCLR_UsbClient_ControlCallback(usClientState);

    switch (result) {

    case USB_STATE_ADDRESS:
        /* upper layer needs us to change the address */
        OTG->DCFG |= usClientState->address << 4; // set device address
        break;

    case USB_STATE_DONE:
        usClientState->dataCallback = 0;
        break;

    case USB_STATE_STALL:
        // setup packet failed to process successfully
        // set stall condition on the control endpoint
        OTG->DIEP[0].CTL |= OTG_DIEPCTL_STALL;
        OTG->DOEP[0].CTL |= OTG_DOEPCTL_STALL;

        // ********** skip rest of function **********
        return;
    }

    // check ep0 for replies
    STM32F7_UsbDevice_EndpointInInterrupt(OTG, usClientState, 0);

    // check all Tx endpoints after configuration setup
    if (result == USB_STATE_CONFIGURATION) {
        for (int32_t ep = 1; ep < usClientState->totalEndpointsCount; ep++) {
            if (usClientState->queues[ep] && usClientState->isTxQueue[ep]) {
                STM32F7_UsbDevice_EndpointInInterrupt(OTG, usClientState, ep);
            }
        }
    }
}

void STM32F7_UsbDevice_EndpointOutInterrupt(OTG_TypeDef* OTG, UsClientState* usClientState, uint32_t ep) {
    uint32_t bits = OTG->DOEP[ep].INT;
    if (bits & OTG_DOEPINT_XFRC) { // transfer completed
        OTG->DOEP[ep].INT = OTG_DOEPINT_XFRC; // clear interrupt
    }

    if (bits & OTG_DOEPINT_STUP) { // setup phase done
        OTG->DOEP[ep].INT = OTG_DOEPINT_STUP; // clear interrupt
    }

    if (ep == 0) { // control endpoint
        // enable endpoint
        OTG->DOEP[0].TSIZ = OTG_DOEPTSIZ_STUPCNT | OTG_DOEPTSIZ_PKTCNT_1 | usClientState->maxEndpointsPacketSize[0];
        OTG->DOEP[0].CTL |= OTG_DOEPCTL_EPENA | OTG_DOEPCTL_CNAK;
        // Handle Setup data in upper layer
        STM32F7_UsbDevice_HandleSetup(OTG, usClientState);
    }
    else if (TinyCLR_UsbClient_CanReceivePackage(usClientState, ep)) {
        // enable endpoint
        OTG->DOEP[ep].TSIZ = OTG_DOEPTSIZ_PKTCNT_1 | usClientState->maxEndpointsPacketSize[ep];
        OTG->DOEP[ep].CTL |= OTG_DOEPCTL_EPENA | OTG_DOEPCTL_CNAK;
    }
    else {
        // disable endpoint
        OTG->DOEP[ep].CTL |= OTG_DOEPCTL_SNAK;
    }
}

void STM32F7_UsbDevice_Interrupt(void* param) {
    INTERRUPT_STARTED_SCOPED(isr);

    DISABLE_INTERRUPTS_SCOPED(irq);

    OTG_TypeDef* OTG = OTG_FS;

    int32_t controller = STM32F7_USB_FS_ID;

    UsClientState* usClientState = usbDeviceControllers[controller].usClientState;

    uint32_t intPend = OTG->GINTSTS; // get pending bits

    while (intPend & OTG_GINTSTS_RXFLVL) { // RxFifo non empty
        uint32_t status = OTG->GRXSTSP; // read and pop status word from fifo
        int32_t ep = status & OTG_GRXSTSP_EPNUM;
        int32_t count = (status & OTG_GRXSTSP_BCNT) >> 4;
        status &= OTG_GRXSTSP_PKTSTS;
        if (status == OTG_GRXSTSP_PKTSTS_PR // data received
            || status == OTG_GRXSTSP_PKTSTS_SR // setup received
            ) {
            STM32F7_UsbDevice_EndpointRxInterrupt(OTG, usClientState, ep, count);
        }
        else {
            // others: nothing to do
        }
        intPend = OTG->GINTSTS; // update pending bits
    }

    if (intPend & OTG_GINTSTS_IEPINT) { // IN endpoint
        uint32_t bits = OTG->DAINT & 0xFFFF; // pending IN endpoints
        int32_t ep = 0;
        while (bits) {
            if (bits & 1)
                STM32F7_UsbDevice_EndpointInInterrupt(OTG, usClientState, ep);
            ep++;
            bits >>= 1;
        }
    }

    if (intPend & OTG_GINTSTS_OEPINT) { // OUT endpoint
        uint32_t bits = OTG->DAINT >> 16; // pending OUT endpoints
        int32_t ep = 0;
        while (bits) {
            if (bits & 1)
                STM32F7_UsbDevice_EndpointOutInterrupt(OTG, usClientState, ep);

